app/Controllers/Aluno.php

SELECT *
FROM `aluno`
---
    public function index()
    {
        $dados = $this->alunoModel->findAll();