app/Controllers/Editora.php

    public function index()
    {
        $dados = $this->editoraModel->findAll();
---
SELECT *
FROM `editora`