app/Controllers/Emprestimo.php

    public function index()
    {
        $dados = $this->emprestimoModel->findAll();
        $alunos = $this->alunoModel->findAll();
        $usuarios = $this->usuarioModel->findAll();
        $livros = $this->livroModel->findAll();
        $obras = $this->obraModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`
SELECT *
FROM `obra`

     public function cadastrar(){
        $emprestimo = $this->request->getPost();
        $this->emprestimoModel->save($emprestimo);
        $this->livroModel->update($emprestimo['id_livro'],['disponivel' => 0]);
---
INSERT INTO `emprestimo` (`data_inicio`, `data_prazo`, `id_livro`, `id_usuario`, `id_aluno`) VALUES ('2024-06-19', '5', '26', '38', '24')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('26')

    public function editar($id){
        $dados = $this->emprestimoModel->find($id);
        $this->livroModel->update($dados['id_livro'],['disponivel' => 1]);
        $alunos = $this->alunoModel->find();
        $usuarios = $this->usuarioModel->find();
        $livros = $this->livroModel->find();
        $obra = $this->obraModel->find();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '75'
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('26')
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`
SELECT *
FROM `obra`

    public function salvar(){
        $emprestimo = $this->request->getPost();
        $this->livroModel->update($emprestimo['id_livro'],['disponivel' => 0]);
        $this->emprestimoModel->save($emprestimo);
---
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('26')
UPDATE `emprestimo` SET `data_inicio` = '2024-06-01', `data_fim` = '2024-06-27', `data_prazo` = '10', `id_livro` = '26', `id_aluno` = '24'
WHERE `emprestimo`.`id` IN ('74')

    public function excluir($id){
        $this->emprestimoModel->delete($id);
---
DELETE FROM `emprestimo`
WHERE `id` IN ('74')