app/Controllers/Home.php

    public function index()
    {
        $usuarios = $this->usuarioModel->findAll();
---
SELECT *
FROM `usuario`