app/Controllers/Livro.php

    public function index()
    {
        $dados = $this->LivroModel->findAll();
        $obra = $this->ObraModel->findAll();
---
SELECT *
FROM `livro`
SELECT *
FROM `obra`

    public function editar($id){
        $dados = $this->LivroModel->find($id);
        $dadosObra = $this->ObraModel->find();
---
SELECT *
FROM `livro`
WHERE `livro`.`id` = '33'
SELECT *
FROM `obra`

    public function salvar(){
        $livro = $this->request->getPost();
        $this->LivroModel->save($livro);
---
UPDATE `livro` SET `disponivel` = '1', `status` = 's', `id_obra` = '46'
WHERE `livro`.`id` IN ('33')

    public function excluir($id){
        $this->LivroModel->delete($id);
---
DELETE FROM `livro`
WHERE `id` IN ('33')