app/Controllers/Login.php

    public function authenticate()
    {
        // Obter os dados do formulário
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        // Verificar se os dados estão vazios
        if (empty($email) || empty($senha)) {
            return redirect()->back()->withInput()->with('error', 'Preencha todos os campos!');
        }

        // Conectar ao banco de dados
        $db = \Config\Database::connect();

        // Selecionar o usuário com o email e senha informados
        $query = $db->table('usuario')->where('email', $email)->where('senha', $senha)->get();
---
SELECT *
FROM `usuario`
WHERE `email` = 'admin@gmail.com'
AND `senha` = 'admin'