app/Controllers/Obra.php

    public function index()
    {
        $dados = $this->obraModel->findAll();
        $editoras = $this->editoraModel->findAll();
---
SELECT *
FROM `obra`
SELECT *
FROM `editora`